Lecture2/cavity/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

// Sample U and p along the two centre lines of the standard 0.1 m cavity.
// The points are placed at z = 0.005 m, halfway through the one-cell thickness.
// End points are slightly inside the walls to avoid point-location ambiguity.

type                sets;
libs                ("libsampling.so");

setFormat           raw;
interpolationScheme cellPoint;

fields              (U p);

sets
{
    verticalCentreLine
    {
        type        uniform;
        axis        distance;
        start       (0.05 0.001 0.005);
        end         (0.05 0.099 0.005);
        nPoints     101;
    }

    horizontalCentreLine
    {
        type        uniform;
        axis        distance;
        start       (0.001 0.05 0.005);
        end         (0.099 0.05 0.005);
        nPoints     101;
    }
}

// ************************************************************************* //
